#include <stdio.h>

int main() {
	unsigned char a, b;

	a = 10; /* 2진수 00001010 */
	b = 25; /* 2진수 00011001*/

	/* 비트단위 보수 00001010 -> 11110101 => 16진수 0xf5 */
	printf("~a = %x\n", ~a);
	
	/* 비트단위 AND 00001010 AND 00011001 -> 00001000 => 16진수 0x08 */
	printf("a&b = %x\n", a&b);

	/* 비트단위 OR 00001010 OR 100011001 -> 00011011 => 16진수 0x1b */
	printf("a|b = %x\n", a|b);

	/* 비트단위 XOR 00001010 XOR 1100011001 -> 00010011 => 16진수 0x13 */
	printf("a^b = %x\n", a^b);

	/* 비트단위 왼쪽 이동 00001010 << 2 -> 00101000 => 16진수 0x28 */
	printf("a<<2 = %x\n", a<<2);

	/* 비트단위 오른쪽 이동 00001010 >> 2 -> 00000010 => 16진수 0x02 */
	printf("a>>2 = %x\n", a>>2);

	return 0;
}
